{
  "tree": {
    "_": "BSP — Block · Spindle · Point (v2). One function. Five modes. Semantic address resolution for pscale JSON blocks. This block is self-demonstrating: bsp('bsp-spec', 0.1) returns the function signature, bsp('bsp-spec', 0.6) returns what it enables.",
    "1": {
      "_": "The function. bsp(block, spindle?, point?) — three arguments, two optional, the name tells you what they are.",
      "1": "block — which block. A name like 'wake' or a block object { tree: {...} }. Resolved via registered loader, or pass the object directly.",
      "2": "spindle — a semantic number. Three formats: 0.234 (delineation, root pscale 0), 23.45 (split, root pscale 2), 2345 (bare, no pscale). Digits walk the tree. Root (tree._) always included first.",
      "3": "point — a pscale level like -2 (numeric), or a mode: '~' for spread, '*' for tree. Focuses or expands the spindle endpoint.",
      "4": "Omit arguments right to left. Block only = full access. Add spindle = follow the path. Add point = focus or expand."
    },
    "2": {
      "_": "Five modes. What you get back depends on what you ask for.",
      "1": "Block mode: bsp('wake') → the full block tree. Navigate freely.",
      "2": "Spindle mode: bsp('wake', 0.842) → root summary (pscale 0), then nodes at keys 8, 4, 2 (pscale -1, -2, -3). A chain of meaning from broad to specific.",
      "3": "Point mode: bsp('wake', 0.842, -2) → just the content at pscale -2 within that spindle. A single string.",
      "4": "Spread mode: bsp('wake', 0.842, '~') → the node's text plus all immediate children. Each child reports digit, text, and whether deeper content exists (branch). This is X~ — lateral scan.",
      "5": "Tree mode: bsp('wake', 0.842, '*') → full recursive subtree from the spindle endpoint. Like resolve() scoped to a branch."
    },
    "3": {
      "_": "Three spindle formats. All reach the same tree endpoint. They differ in pscale labeling.",
      "1": "0.234 — delineation. Leading zero stripped. Walk digits [2,3,4]. Root is pscale 0. The standard format.",
      "2": "23.45 — split. Walk all digits [2,3,4,5]. Root is pscale 2 (integer length). For blocks where root pscale > 0.",
      "3": "2345 — bare. Walk all digits [2,3,4,5]. No pscale labeling (no decimal). When labels don't matter.",
      "4": "Root (tree._) is always included as the first spindle node regardless of format."
    },
    "4": {
      "_": "X vocabulary. The touchstone's three navigation operations, all expressible through bsp.",
      "1": "X+ (shallower): bsp(block, spindle, pscale+1) — move up one level. On the spindle, this is index arithmetic. On the JSON, shorten the spindle.",
      "2": "X- (deeper): bsp(block, spindle, pscale-1) — move down one level. Beyond the spindle, use '~' to discover what exists deeper.",
      "3": "X~ (siblings): bsp(block, parentSpindle, '~') — spread at the parent to see all children at the same level. Lateral scan.",
      "4": "Two contexts: X on the spindle (already-pulled chain) = point arithmetic on the nodes array. X on the JSON (beyond the spindle) = spread and tree modes."
    },
    "5": {
      "_": "Where it lives. Infrastructure, not content. The road, not a building on the road.",
      "1": "bsp lives in pscale-touchstone alongside the touchstone. Touchstone teaches format, bsp navigates it. Two faces of one thing.",
      "2": "lib/bsp.js (vanilla JavaScript), lib/bsp.ts (TypeScript), lib/bsp.py (Python). Same interface. ~170 lines each. Zero dependencies.",
      "3": "bsp-spec.md for developers. bsp-spec.json (this block) for hermitcrabs.",
      "4": "The function is pure — runs in browser, Node, Deno, sandbox, code_execution. Any environment with JSON can use it."
    },
    "6": {
      "_": "What it enables. bsp is the only syscall.",
      "1": "Aperture = bsp(block) at pscale 0 across all blocks. One call per dimension.",
      "2": "Focus = bsp(block, spindle) on the blocks that matter. Adjustable depth.",
      "3": "Lateral scan = bsp(block, spindle, '~'). Discover siblings and children without pulling the full tree.",
      "4": "Subtree read = bsp(block, spindle, '*'). Pull an entire branch for deep inspection.",
      "5": "Boot = bsp('wake', 0.61) — 'First boot. Read everything. Orient.'",
      "6": "Grain probe = a list of bsp addresses. 'Read my bsp(\"purpose\", 0.21), respond with yours.'",
      "7": "Context specification = choosing which bsp calls to include in the system prompt.",
      "8": "Self-modification = the LLM rewriting its own bsp instruction lists between loops."
    },
    "7": {
      "_": "Evolution. From keystone to bsp v2.",
      "1": "Keystone (v1, 17 Feb): the original self-describing block with decimal field. Taught structure, navigation, growth, connection.",
      "2": "Touchstone (v4, 19 Feb): keystone renamed, refined. Speculative structures added (resonance, density, standing wave).",
      "3": "bsp v1 (20 Feb): three modes (block, spindle, point). 0.xxx format only. TypeScript and Python. ~90 lines each.",
      "4": "bsp v2 (25 Feb): five modes (+spread, +tree). Three spindle formats. X+/X-/X~ vocabulary. Root always included. Vanilla JS added. Extracted from hermitcrab G1 kernel. ~170 lines each."
    }
  }
}
